back_end/load_test/login.yml
config:
  target: "https://localhost:8080/api"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "data.csv"
    fields:
      - "data"

scenarios:
  - name: "Search and buy"
    flow:
      - post:
          url: "/"
          json:
            kw: "{{ data }}"
          capture:
            - json: "$.results[0].id"
              as: "productId"
      - get:
          url: "/"
      - think: 5
      - post:
          url: "/"
          json:
            productId: "{{ productId }}"